#+TITLE: Literate Programming
#+DATE: 2021-03-05
#+OPTIONS: toc:nil

Here's a blog post on literate programming!

*** Literate Programming With R
#+begin_src R :exports code :exports both
new_function <- function(a, b) {
  return(a + b)
}

new_function(10, 20)
#+end_src

#+RESULTS:
: 30
*** Literate Programming with Python
#+begin_src python :results output :exports both
def new_func(a, b):
    return a + b
print(new_func(10, 10))
#+end_src

#+RESULTS:
: 20
